Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// регистр Взаиморасчеты
	Движения.Взаиморасчеты.Записывать = Истина;
	Для Каждого ТекСтрокаРаботы из Работы Цикл
		Движение = Движения.Взаиморасчеты.Добавить();
		Движение.Период 		= Дата;
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
		Движение.Заявка			= Ссылка;
		Движение.ВидРабот		= ТекСтрокаРаботы.ВидРабот;
		Движение.ЧеловекоЧасы	= ТекСтрокаРаботы.ЧеловекоЧасы;
		Движение.СтоимостьРабот			= ТекСтрокаРаботы.СтоимостьРабот;
	КонецЦикла;	

КонецПроцедуры