

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		// регистр Взаиморасчеты
	Движения.Взаиморасчеты.Записывать = Истина;
	Для Каждого ТекСтрокаРаботы из ОплаченыеРаботы Цикл
		Движение = Движения.Взаиморасчеты.Добавить();
		Движение.Период 		= Дата;
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
		Движение.Заявка			= ТекСтрокаРаботы.Заявка;
		Движение.ВидРабот			= ТекСтрокаРаботы.ВидРабот;
		Движение.ЧеловекоЧасы	= ТекСтрокаРаботы.ЧеловекоЧасы;
		Движение.СтоимостьРабот			= ТекСтрокаРаботы.СтоимостьРабот;
	КонецЦикла;	
КонецПроцедуры
